results/sprint-5-load-test-raw-output.txt
  █ THRESHOLDS

    incident_report_duration
    ✓ 'p(95)<500' p(95)=422.3ms

    incident_report_errors
    ✓ 'rate<0.01' rate=0.00%

    official_alert_duration
    ✓ 'p(95)<300' p(95)=48.12ms

    official_alert_errors
    ✓ 'rate<0.001' rate=0.00%


  █ TOTAL RESULTS

    CUSTOM
    incident_report_duration.......: avg=241.72ms min=110.34ms med=220ms  max=1.01s p(90)=303.97ms p(95)=422.3ms
    incident_report_errors.........: 0.00%  0 out of 312
    official_alert_duration........: avg=18.07ms  min=617.12µs med=2.71ms max=1s    p(90)=16.87ms  p(95)=48.12ms
    official_alert_errors..........: 0.00%  0 out of 1560

    HTTP
    http_req_duration..............: avg=55.35ms  min=617.12µs med=3.32ms max=1.01s p(90)=221.76ms p(95)=282.49ms
      { expected_response:true }...: avg=55.35ms  min=617.12µs med=3.32ms max=1.01s p(90)=221.76ms p(95)=282.49ms
    http_req_failed................: 0.00%  0 out of 1872
    http_reqs......................: 1872   30.130228/s

    EXECUTION
    iteration_duration.............: avg=2.37s    min=2.12s    med=2.26s  max=3.87s p(90)=2.68s    p(95)=3.43s
    iterations.....................: 312    5.021705/s
    vus............................: 2      min=2         max=12
    vus_max........................: 12     min=12        max=12

    NETWORK
    data_received..................: 1.5 MB 24 kB/s
    data_sent......................: 238 kB 3.8 kB/s